<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DBeaver Community and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.lr-recipes.pkg.DBeaverCommunity</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>DBeaver</string>
		<key>NAME</key>
		<string>DBeaver Community</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.lr-recipes.download.DBeaverCommunity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/DBeaver.app</string>
				<key>output_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
				<key>output_path</key>
				<string>%RECIPE_CACHE_DIR%/DBeaver.pkg/Payload/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>PathMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>DBeaverCommunity-%version%-%ARCH%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>GenericPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>