Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of DBeaver Community and imports it into Munki.
Identifier: com.github.lr-recipes.munki.DBeaverCommunity
ParentRecipe: com.github.lr-recipes.pkg.DBeaverCommunity
MinimumVersion: 1.0.0

Input:
  NAME: DBeaver Community
  APP_FILENAME: DBeaver
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Free universal database tool and SQL client
    developer: DBeaver Corporation
    display_name: DBeaver Community
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
