Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of DBeaver Community.
Identifier: com.github.lr-recipes.download.DBeaverCommunity
MinimumVersion: 1.0.0

Input:
  NAME: DBeaver Community
  APP_FILENAME: DBeaver

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*x86_64\.dmg$
    github_repo: dbeaver/dbeaver

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%-x86_64.dmg'
    download_dir: '%RECIPE_CACHE_DIR%/downloads'

- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*aarch64\.dmg$
    github_repo: dbeaver/dbeaver

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%-arm64.dmg'
    download_dir: '%RECIPE_CACHE_DIR%/downloads'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/DBeaver.app'
    requirement: identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-x86_64.dmg/DBeaver.app'
    requirement: identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/DBeaver.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
