Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of DBeaver Community and creates a package.
Identifier: com.github.lr-recipes.pkg.DBeaverCommunity
ParentRecipe: com.github.lr-recipes.download.DBeaverCommunity
MinimumVersion: 2.3

Input:
  NAME: DBeaver Community
  APP_FILENAME: DBeaver

Process:
- Processor: AppPkgCreator
