<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DBeaver Community.</string>
		<key>Identifier</key>
		<string>com.github.lr-recipes.download.DBeaverCommunity</string>
		<key>MinimumVersion</key>
		<real>2.3</real>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>.*x86_64\.dmg$$</string>
					<key>github_repo</key>
					<string>dbeaver/dbeaver</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<string></string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/DBeaver.app</string>
					<key>requirement</key>
					<string>identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate
1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
/* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/DBeaver.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
