<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Chromium</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/chromium</string>
		<key>NAME</key>
		<string>Chromium</string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Chromium is a free and open source web browser.</string>
			<key>display_name</key>
			<string>Chromium</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.pkg.Chromium</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.ahousseini-recipes.download.Chromium</key>
			<dict>
				<key>git_hash</key>
				<string>886011b1f8e59d71775de1a4653d2d6ea41d51eb</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.ahousseini-recipes/Chromium/Chromium.download.recipe</string>
				<key>sha256_hash</key>
				<string>2bc1d7a66bb25ba3a9c8fa4e8013697f9835642cedbd76b2d98bd298ee634ae6</string>
			</dict>
			<key>com.github.ahousseini-recipes.pkg.Chromium</key>
			<dict>
				<key>git_hash</key>
				<string>886011b1f8e59d71775de1a4653d2d6ea41d51eb</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.ahousseini-recipes/Chromium/Chromium.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>e0aa9d2c269e9ee1d0a0170a51a8d5c3418397e6a7056f05b5cfb8ad2941fdc2</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
