Comment: Based on https://github.com/autopkg/homebysix-recipes
Description: Downloads the latest version of MySQLWorkbench.
Identifier: com.github.lr-recipes.download.MySQLWorkbenchUniversal
MinimumVersion: '2.3'

Input:
  NAME: MySQLWorkbench
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/603.3.8 (KHTML, like Gecko) Version/10.1.2 Safari/603.3.8

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<dmg>mysql-workbench-community-(?P<version>[\d.]+)-\S+arm64\.dmg)
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://dev.mysql.com/downloads/workbench

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%-arm64.dmg'
    download_dir: '%RECIPE_CACHE_DIR%/downloads'
    url: https://dev.mysql.com/get/Downloads/MySQLGUITools/%dmg%

- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<dmg>mysql-workbench-community-(?P<version>[\d.]+)-\S+x86_64\.dmg)
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://dev.mysql.com/downloads/workbench

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%-x86_64.dmg'
    download_dir: '%RECIPE_CACHE_DIR%/downloads'
    url: https://dev.mysql.com/get/Downloads/MySQLGUITools/%dmg%

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-arm64.dmg/MySQLWorkbench.app'
    requirement: identifier "com.oracle.workbench.MySQLWorkbench" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-x86_64.dmg/MySQLWorkbench.app'
    requirement: identifier "com.oracle.workbench.MySQLWorkbench" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963
