Description: Downloads the latest version of Tabby and creates a package.
Identifier: com.github.lr-recipes.pkg.Tabby
ParentRecipe: com.github.lr-recipes.download.Tabby
MinimumVersion: '2.3'

Input:
  NAME: Tabby
  APP_FILENAME: Tabby

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/Universal'
      pkgdirs:
        pkgroot: '0775'
        Scripts: '0775'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Tabby.app'
      pkg_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-arm64-%version%.pkg'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/Tabby.app'
      pkg_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-x86_64-%version%.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/preinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash
        arm64_package="%NAME%-arm64-%version%.pkg"
        x86_64_package="%NAME%-x86_64-%version%.pkg"
        if [[ $( /usr/bin/arch ) = arm64* ]]; then
          /usr/sbin/installer -pkg "$arm64_package" -target "$3"
        else
          /usr/sbin/installer -pkg "$x86_64_package" -target "$3"
        fi
        exit 0

  - Processor: FileCreator
  Arguments:
    file_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/postinstall'
    file_mode: '0755'
    file_content: |
      #!/bin/bash
      CONSOLE_USER=$(ls -l /dev/console | awk "{ print \$3 }")
      /usr/sbin/chown -R "$CONSOLE_USER": "/Applications/Tabby.app"
      exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: '%bundleid%'
        version: '%version%'
        options: purge_ds_store
        pkgname: '%NAME%-Universal-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        scripts: '%RECIPE_CACHE_DIR%/Universal/Scripts'
        pkgroot: '%RECIPE_CACHE_DIR%/Universal/pkgroot'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-x86_64-%version%.pkg'
        - '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-arm64-%version%.pkg'